<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"7e4caec5c2f48ec5c00d9eef8a03cd7c948e518a8bef65dc8562908ac39b44a8","plan_job_ref":"Job Staging Image Build & Push #27 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328887234","plan_hash":"2369b357bc3cbb111fe6b885c640571cf985a348dfefde7186e55852150b84f8","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster must be replaced
-/+ resource "aws_ecs_cluster" "fastapi-cluster" {
!~      arn      = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster" -> (known after apply)
!~      id       = "*************************************************************" -> (known after apply)
!~      name     = "fastapi-cluster" -> "dev-fastapi-cluster" # forces replacement
-       tags     = {} -> null
!~      tags_all = {} -> (known after apply)

#        (1 unchanged block hidden)
    }

  # aws_ecs_service.fastapi-service must be replaced
-/+ resource "aws_ecs_service" "fastapi-service" {
!~      cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster" # forces replacement -> (known after apply) # forces replacement
-       health_check_grace_period_seconds  = 0 -> null
!~      iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
!~      id                                 = "*********************************************************************************" -> (known after apply)
        name                               = "dev-fastapi-service"
!~      platform_version                   = "LATEST" -> (known after apply)
-       propagate_tags                     = "NONE" -> null
-       tags                               = {} -> null
!~      tags_all                           = {} -> (known after apply)
!~      triggers                           = {
-           "redeployment" = "2023-12-26T10:30:05Z"
        } -> (known after apply)
#        (10 unchanged attributes hidden)

-       deployment_circuit_breaker {
-           enable   = false -> null
-           rollback = false -> null
        }

-       deployment_controller {
-           type = "ECS" -> null
        }

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #27](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328887234)